# Ορισμός του μεταγλωττιστή (GCC)
CC = gcc

# Επιλογές μεταγλώττισης:
# -Wall: Ενεργοποίηση όλων των προειδοποιήσεων
# -pthread: Ενεργοποίηση υποστήριξης για πολυνηματική εκτέλεση (threads)
CFLAGS = -Wall -pthread

# Το όνομα του τελικού εκτελέσιμου αρχείου
TARGET = eshop

# Στόχος 'all': Δημιουργεί το εκτελέσιμο αρχείο
all: $(TARGET)

# Στόχος για τη δημιουργία του εκτελέσιμου αρχείου από το αρχείο αντικειμένου
$(TARGET): eshop.o
	$(CC) $(CFLAGS) -o $(TARGET) eshop.o

# Στόχος για τη μεταγλώττιση του αρχείου πηγαίου κώδικα σε αρχείο αντικειμένου
eshop.o: eshop.c eshop.h
	$(CC) $(CFLAGS) -c eshop.c

# Στόχος 'clean': Διαγράφει τα ενδιάμεσα αρχεία αντικειμένου και το εκτελέσιμο αρχείο
clean:
	rm -f *.o $(TARGET)
